[
  {
    "nid": "97431",
    "title": "Virgo",
    "image": "http:\/\/newsmobile.in\/wp-content\/uploads\/2015\/08\/Virgo-128.png",
    "content": "Mercury and the waning Solar Eclipse encourage you to listen to others closely and keep the channels of communication open. Is a loved one going through a rough patch? Don’t lecture them Virgo! Strive to help them in a sensitive and compassionate way. But expect a turbulent financial week, as the planets shake up your previous expectations. Time to reformulate your fiscal plans! When it comes to work and business, it’s much better to under-promise and over-deliver."
  },
  {
    "nid": "97380",
    "title": "Aries",
    "image": "http:\/\/newsmobile.in\/wp-content\/uploads\/2015\/08\/aries.png",
    "content": "Nobody knows better than you that sometimes it really does take an enormous amount of energy to walk away from unpleasant situations. However, disagreeable encounters must now be defused with wisdom and restraint. If you tackle a long-standing moral question, you’ll find that your views have changed.\r\n\r\n(Courtsey: Peter Vidal)"
  },
  {
    "nid": "97429",
    "title": "Leo",
    "image": "http:\/\/newsmobile.in\/wp-content\/uploads\/2015\/08\/Leo.png",
    "content": "It’s a volatile week so keep your cool Cats! Avoid spreading unsubstantiated gossip and blurting out things that you’ll later regret. Take the time to check the facts first. The more humble and honest you are, the better the week will be. But you should certainly express your adventurous side, as you make a leap of faith or take a smart calculated risk. As birthday great Elizabeth Taylor declared “There are so many doors to be opened, and I’m not afraid to look behind them.”"
  },
  {
    "nid": "97427",
    "title": "Cancer",
    "image": "http:\/\/newsmobile.in\/wp-content\/uploads\/2015\/08\/cancer.png",
    "content": "Avoid using emotional manipulation to coerce people into doing what you think they should be doing. This week, let others make their own choices [and their own mistakes]. It’s also time to initiate overdue career and\/or domestic changes … before Mars, Jupiter and Uranus step in and do it for you! Attached Crabs – Friday night favours a profound emotional connection. Singles – forget superficial suitors. Look for a long-term lover who has depth and staying-power."
  },
  {
    "nid": "97425",
    "title": "Gemini",
    "image": "http:\/\/newsmobile.in\/wp-content\/uploads\/2015\/08\/Gemini.png",
    "content": "Expect some turmoil this week, especially involving children, teenagers, friends or acquaintances. So strive to maintain a flexible approach and a diplomatic demeanour. You’re in a hurry to get ahead but be especially cautious when it comes to your social circle. As birthday great, Anthony Robbins observes “People’s lives are a direct reflection of the expectations of their peer group.” So make sure your friendships are inspiring, and your expectations are high!"
  },
  {
    "nid": "97423",
    "title": "Taurus",
    "image": "http:\/\/newsmobile.in\/wp-content\/uploads\/2015\/08\/Taurus-128.png",
    "content": "With so many planets in Pisces and Aries, being flexible and fast is the key to a successful week. If you are too stubborn and unyielding in your opinions, then others will just stop listening to what you have to say. And if you are too slow off the mark [and hesitant to take action] then others will streak ahead of you, especially at work. So your motivation motto is from fellow Taurean, actress Shirley MacLaine “Don’t be afraid to go out on a limb. It’s where all the fruit is.”"
  },
  {
    "nid": "97433",
    "title": "Libra",
    "image": "http:\/\/newsmobile.in\/wp-content\/uploads\/2015\/08\/Libra.png",
    "content": "Librans long for peace and harmony. You want everything to run smoothly this week but it’s just not going to happen! Work relationships will be unpredictable and loved ones disruptive, so revise your expectations and just take things as they come. With Jupiter activating your sign [until October 10] look for exciting ways to expand your influence in the world around you. You’ll find the more you extend yourself and encourage others, the more successful you’ll be."
  },
  {
    "nid": "97435",
    "title": "Scorpio",
    "image": "http:\/\/newsmobile.in\/wp-content\/uploads\/2015\/08\/Scorpio.png",
    "content": "This week unpredictable Uranus, Mars and Jupiter are set to disrupt your usual routine! Trying to control your timetable [or impose it on others] will just frustrate everyone and get you nowhere fast. So consider swapping Scorpio stubbornness, sarcasm or sulking for cool, clever compromise. If you’re still feeling unsettled then meditation, yoga or some other form of quiet contemplation will help calm you down, as you go with the celestial flow and listen to the wise voice within."
  },
  {
    "nid": "97442",
    "title": "Aquarius",
    "image": "http:\/\/newsmobile.in\/wp-content\/uploads\/2015\/08\/aquarius.png",
    "content": "Hold onto your seat – it’s going to be a bumpy ride! Your ruler Uranus sends disruptions in your direction, plus Jupiter demands that you stop being stubborn and start being more adventurous. So the only certainty at the moment is change. You’re feeling ridiculously restless but try to modify your reactions, otherwise it will be a long and tiring week. Just because you’re in the process of shaking up your life doesn’t mean you have to unsettle everyone around you."
  },
  {
    "nid": "97440",
    "title": "Capricorn",
    "image": "http:\/\/newsmobile.in\/wp-content\/uploads\/2015\/08\/capricorn.png",
    "content": "The more intently you micro-manage relationships this week, the more family, friends or colleagues will distance themselves from you. And if you are too bossy with an Aries, Leo or Sagittarian, then an explosive power struggle is likely. You’re brimming over with information and ideas, and are keen to teach or instruct others. But don’t assume you have all the answers. Smart-aleck hubris will just put others off. So strive to be much more inclusive and consultative."
  },
  {
    "nid": "97438",
    "title": "Sagittarius",
    "image": "http:\/\/newsmobile.in\/wp-content\/uploads\/2015\/08\/sagittarius.png",
    "content": "Are you ready for a wild ride? This week you’re prone to fiery pronouncements and extravagant exuberance as you overpromise, overspend or overextend. Enthusiasm is high but don’t jump to hasty conclusions, and then pass on incorrect information. Get the facts straight, otherwise embarrassing mix-ups are likely [especially involving family or friends]. Do your best to channel excess energy into a challenging project that is ambitious and adventurous but also realistic."
  },
  {
    "nid": "97446",
    "title": "Pisces",
    "image": "http:\/\/newsmobile.in\/wp-content\/uploads\/2015\/08\/Pisces.png",
    "content": "What you must do now is pay your dues, honour past commitments and do what you know is proper. Then nobody will be able to get the better of you or imply that you have not done your best. You’re a disciplined person in many ways, much more so than many people believe, and therein lies the key to your success.\r\n\r\n(courtesy: Peter Vidal)"
  }
]